Tekla Open API Reference for Tekla Structures 2025
Phase Constructor (Int32)
 Instantiates a new phase with the given phase number.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Phase(
	int PhaseNumber
)
Public Sub New (
	PhaseNumber As Integer
)
Parameters
PhaseNumber
Type: System.Int32
The number of the phase.
See Also
Reference
Phase Class
Phase Overload
Tekla.Structures.Model Namespace